Revit 2027 API
BuiltInFailures.RoomFailures.OptionConflictBoundariesVaryMainSeparate Property
 Option Conflict between Rooms.\nRoom boundary in the Main Model differs from the apparent boundary in view '[View Name]'.\nTo resolve, divide space with Room Separation Lines in the Main Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OptionConflictBoundariesVaryMainSeparate { get; }
Public Shared ReadOnly Property OptionConflictBoundariesVaryMainSeparate As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OptionConflictBoundariesVaryMainSeparate {
	FailureDefinitionId^ get ();
}
static member OptionConflictBoundariesVaryMainSeparate : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace